#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.aws_init.data.aws_iam_policy_document.terraform_admin: Refreshing state...

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.aws_init.aws_iam_access_key.terraform_admin will be created
  + resource "aws_iam_access_key" "terraform_admin" {
      + encrypted_secret     = (known after apply)
      + id                   = (known after apply)
      + key_fingerprint      = (known after apply)
      + pgp_key              = "keybase:rytswd"
      + secret               = (sensitive value)
      + ses_smtp_password    = (sensitive value)
      + ses_smtp_password_v4 = (sensitive value)
      + status               = (known after apply)
      + user                 = "TerraformAdmin"
    }

  # module.aws_init.aws_iam_user.terraform_admin will be created
  + resource "aws_iam_user" "terraform_admin" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "TerraformAdmin"
      + path          = "/"
      + unique_id     = (known after apply)
    }

  # module.aws_init.aws_iam_user_policy.terraform_admin_assume_role will be created
  + resource "aws_iam_user_policy" "terraform_admin_assume_role" {
      + id     = (known after apply)
      + name   = "AssumeRoleForTerraformAdmin"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "*"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + user   = "TerraformAdmin"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```

</details>

*Pusher: @rytswd, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Project Init`*